ALTER TABLE Bill
ADD UCR VARCHAR(50), -- Ім'я користувача, що створив запис
    DCR DATETIME, -- Дата та час створення запису
    ULC VARCHAR(50), -- Ім'я користувача, що останнім змінив запис
    DLC DATETIME; -- Дата та час останньої модифікації запису

ALTER TABLE Lease
ADD UCR VARCHAR(50), -- Ім'я користувача, що створив запис
    DCR DATETIME, -- Дата та час створення запису
    ULC VARCHAR(50), -- Ім'я користувача, що останнім змінив запис
    DLC DATETIME; -- Дата та час останньої модифікації запису

ALTER TABLE Payment
ADD UCR VARCHAR(50), -- Ім'я користувача, що створив запис
    DCR DATETIME, -- Дата та час створення запису
    ULC VARCHAR(50), -- Ім'я користувача, що останнім змінив запис
    DLC DATETIME; -- Дата та час останньої модифікації запису

ALTER TABLE Place
ADD UCR VARCHAR(50), -- Ім'я користувача, що створив запис
    DCR DATETIME, -- Дата та час створення запису
    ULC VARCHAR(50), -- Ім'я користувача, що останнім змінив запис
    DLC DATETIME; -- Дата та час останньої модифікації запису

ALTER TABLE PlaceType
ADD UCR VARCHAR(50), -- Ім'я користувача, що створив запис
    DCR DATETIME, -- Дата та час створення запису
    ULC VARCHAR(50), -- Ім'я користувача, що останнім змінив запис
    DLC DATETIME; -- Дата та час останньої модифікації запису

ALTER TABLE Tenant
ADD UCR VARCHAR(50), -- Ім'я користувача, що створив запис
    DCR DATETIME, -- Дата та час створення запису
    ULC VARCHAR(50), -- Ім'я користувача, що останнім змінив запис
    DLC DATETIME; -- Дата та час останньої модифікації запису